In [6]:
from sqlalchemy import create_engine
import pandas as pd

In [7]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [8]:
engine = create_engine(connection_string)

In [9]:
query = '''
SELECT latitude, longitude
FROM scooters
LIMIT 5;
'''

In [10]:
lat = pd.read_sql(query, con = engine)
lat.head()

    latitude  longitude
0  36.136822 -86.799877
1  36.191252 -86.772945
2  36.144752 -86.806293
3  36.162056 -86.774688
4  36.150973 -86.783109

In [12]:
query = '''
SELECT DISTINCT(sumdid),
companyname
FROM scooters;
'''

In [13]:
company_scooters = pd.read_sql(query, con = engine)
company_scooters.head()

                                         sumdid companyname
0  Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619        Bolt
1  Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d        Bolt
2  Powered-03be23ca-d43b-222f-be54-e44b5b4690df        Bolt
3  Powered-046201fb-6532-1f37-6334-3612fb1e61f7        Bolt
4  Powered-0479bb84-afbd-0426-f1c4-df628542a88c        Bolt

In [14]:
df2 = company_scooters.groupby(['companyname'])['companyname'].count()
print(df2)

companyname
Bird      3860
Bolt       360
Gotcha     224
Jump      1210
Lime      1824
Lyft      1735
Spin       805
Name: companyname, dtype: int64

In [15]:
company_scooters.count()

sumdid         10018
companyname    10018
dtype: int64